app/controllers/todos_controller.rb

  def index
    @todos ||= Todo.all.order(priority_level: :desc)
---
SELECT "todos"."priority_level" FROM "todos"

  def show
    @todo ||= Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "description", "created_at", "updated_at", "priority_level") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "bbbbb"], ["description", "rewrwer"], ["created_at", "2018-12-17 18:00:59.058881"], ["updated_at", "2018-12-17 18:00:59.058881"], ["priority_level", 8]]

  def edit
    @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def update
    @todo = Todo.find(params[:id])
    if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "todos" SET "priority_level" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["priority_level", 6], ["updated_at", "2018-12-18 00:24:15.242373"], ["id", 3]]

  def destroy
    @todo = Todo.find(params[:id])
    title = @todo.title
    if @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 20]]