app/models/todo.rb

SELECT "todos"."priority_level" FROM "todos"
SELECT "todos".* FROM "todos" GROUP BY "todos"."priority_level"
---
  def self.prioritize
    levels, result = self.pluck(:priority_level), Hash.new(0)
    levels.each_with_object(result) { |level,count| count[level] += 1 }
    result.select { |k,v| v > 1 }.sort_by { |k, v| k }.reverse